In [1]:
import numpy as np
import pandas as pd

In [3]:
d1={
    'Name':['A','B','C','D'],
    'Sem1':[89,69,78,68]
}

d2={
    'Name':['E','F','G','H'],
    'Sem1':[81,70,72,88]
}

In [4]:
dfd1=pd.DataFrame(d1)

In [5]:
dfd2=pd.DataFrame(d2)

In [9]:
dfconcat=pd.concat([dfd1,dfd2],axis=0)

In [10]:
dfconcat

  Name  Sem1
0    A    89
1    B    69
2    C    78
3    D    68
0    E    81
1    F    70
2    G    72
3    H    88

In [11]:
dfconcat.loc[0] # 0 is considered as index labels

  Name  Sem1
0    A    89
0    E    81

In [12]:
dfconcat.iloc[0] # it is considered as index values

Name     A
Sem1    89
Name: 0, dtype: object

In [19]:
d3={
    'Name':['A','B','C','D'],
    'Sem1':[89,69,78,68]
}

d4={
    'Name':['A','B','C','D'],
    'Sem2':[81,70,72,88]
}

In [42]:
dfd3=pd.DataFrame(d3)

In [43]:
dfd4=pd.DataFrame(d4)

In [22]:
display(dfd3,dfd4)

  Name  Sem1
0    A    89
1    B    69
2    C    78
3    D    68

  Name  Sem2
0    A    81
1    B    70
2    C    72
3    D    88

In [23]:
pd.concat([dfd3,dfd4],axis=1)

  Name  Sem1 Name  Sem2
0    A    89    A    81
1    B    69    B    70
2    C    78    C    72
3    D    68    D    88

In [24]:
dfd3

  Name  Sem1
0    A    89
1    B    69
2    C    78
3    D    68

In [26]:
dfd3=dfd3.set_index('Name')

In [27]:
dfd3

      Sem1
Name
A       89
B       69
C       78
D       68

In [28]:
dfd3.index

Index(['A', 'B', 'C', 'D'], dtype='object', name='Name')

In [30]:
dfd3=dfd3.reset_index()

In [31]:
dfd3

  Name  Sem1
0    A    89
1    B    69
2    C    78
3    D    68

In [32]:
dfd3.index

RangeIndex(start=0, stop=4, step=1)

In [33]:
dfd3=dfd3.set_index('Name')

In [34]:
dfd3

      Sem1
Name
A       89
B       69
C       78
D       68

In [35]:
dfd4=dfd4.set_index('Name')

In [36]:
dfd4

      Sem2
Name
A       81
B       70
C       72
D       88

In [37]:
display(dfd3,dfd4)

      Sem1
Name
A       89
B       69
C       78
D       68

      Sem2
Name
A       81
B       70
C       72
D       88

In [ ]:
# axis=0 means based on column labels and axis=1 means based on index

In [38]:
dffinal=pd.concat([dfd3,dfd4],axis=1)

In [39]:
dffinal

      Sem1  Sem2
Name
A       89    81
B       69    70
C       78    72
D       68    88

In [40]:
dffinal=dffinal.reset_index()

In [41]:
dffinal

  Name  Sem1  Sem2
0    A    89    81
1    B    69    70
2    C    78    72
3    D    68    88

In [ ]:
# OR

In [44]:
dfd3 # called again

  Name  Sem1
0    A    89
1    B    69
2    C    78
3    D    68

In [45]:
dfd4 # called again

  Name  Sem2
0    A    81
1    B    70
2    C    72
3    D    88

In [46]:
pd.merge(dfd3,dfd4)

  Name  Sem1  Sem2
0    A    89    81
1    B    69    70
2    C    78    72
3    D    68    88